#pragma once
#include "Config.h"
#define HEX_DWORD_BLOCK_SIZE 8														// Розбір 32-бітного блока у шістнадцятковому вигляді
#define C_SHL(x, k) (((x) << (k)) | ((x) >> (sizeof(x)*8L - (k))))					// Операція циклічного зсуву уліво

//=========================================================================================================
enum E_Encrypt_Mode {																// Режим шифрування/дешифрування (генерації раундових ключів)
	EEM_Decrypt,
	EEM_Encrypt
};
//=========================================================================================================
enum E_Demo_Mode {
	EDM_Disabled,
	EDM_Enabled
};
//=========================================================================================================
void SM4Process(String^ path_initialtext, String^ path_finaltext, 					// Функція виконання алгоритму SM4 із заміром часу виконання
	E_Encrypt_Mode encrypt_mode, DWORD MK[], E_Demo_Mode demo_mode);				// 
//=========================================================================================================